; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-6nodes-1000size-5degree-100mindistance-2trucks-5packages-1277seed

(define (problem transport-two-cities-sequential-6nodes-1000size-5degree-100mindistance-2trucks-5packages-1277seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  city-1-loc-6 - location
  city-2-loc-6 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 773,702 -> 226,665
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 55)
  ; 226,665 -> 773,702
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 55)
  ; 413,831 -> 226,665
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 25)
  ; 226,665 -> 413,831
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 25)
  ; 413,831 -> 773,702
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 39)
  ; 773,702 -> 413,831
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 39)
  ; 686,429 -> 226,665
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 52)
  ; 226,665 -> 686,429
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 52)
  ; 686,429 -> 773,702
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 29)
  ; 773,702 -> 686,429
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 29)
  ; 686,429 -> 413,831
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 49)
  ; 413,831 -> 686,429
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 49)
  ; 62,968 -> 226,665
  (road city-1-loc-5 city-1-loc-1)
  (= (road-length city-1-loc-5 city-1-loc-1) 35)
  ; 226,665 -> 62,968
  (road city-1-loc-1 city-1-loc-5)
  (= (road-length city-1-loc-1 city-1-loc-5) 35)
  ; 62,968 -> 413,831
  (road city-1-loc-5 city-1-loc-3)
  (= (road-length city-1-loc-5 city-1-loc-3) 38)
  ; 413,831 -> 62,968
  (road city-1-loc-3 city-1-loc-5)
  (= (road-length city-1-loc-3 city-1-loc-5) 38)
  ; 612,552 -> 226,665
  (road city-1-loc-6 city-1-loc-1)
  (= (road-length city-1-loc-6 city-1-loc-1) 41)
  ; 226,665 -> 612,552
  (road city-1-loc-1 city-1-loc-6)
  (= (road-length city-1-loc-1 city-1-loc-6) 41)
  ; 612,552 -> 773,702
  (road city-1-loc-6 city-1-loc-2)
  (= (road-length city-1-loc-6 city-1-loc-2) 22)
  ; 773,702 -> 612,552
  (road city-1-loc-2 city-1-loc-6)
  (= (road-length city-1-loc-2 city-1-loc-6) 22)
  ; 612,552 -> 413,831
  (road city-1-loc-6 city-1-loc-3)
  (= (road-length city-1-loc-6 city-1-loc-3) 35)
  ; 413,831 -> 612,552
  (road city-1-loc-3 city-1-loc-6)
  (= (road-length city-1-loc-3 city-1-loc-6) 35)
  ; 612,552 -> 686,429
  (road city-1-loc-6 city-1-loc-4)
  (= (road-length city-1-loc-6 city-1-loc-4) 15)
  ; 686,429 -> 612,552
  (road city-1-loc-4 city-1-loc-6)
  (= (road-length city-1-loc-4 city-1-loc-6) 15)
  ; 2263,189 -> 2260,86
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 11)
  ; 2260,86 -> 2263,189
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 11)
  ; 2195,697 -> 2260,86
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 62)
  ; 2260,86 -> 2195,697
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 62)
  ; 2195,697 -> 2642,983
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 54)
  ; 2642,983 -> 2195,697
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 54)
  ; 2195,697 -> 2263,189
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 52)
  ; 2263,189 -> 2195,697
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 52)
  ; 2069,978 -> 2642,983
  (road city-2-loc-5 city-2-loc-2)
  (= (road-length city-2-loc-5 city-2-loc-2) 58)
  ; 2642,983 -> 2069,978
  (road city-2-loc-2 city-2-loc-5)
  (= (road-length city-2-loc-2 city-2-loc-5) 58)
  ; 2069,978 -> 2195,697
  (road city-2-loc-5 city-2-loc-4)
  (= (road-length city-2-loc-5 city-2-loc-4) 31)
  ; 2195,697 -> 2069,978
  (road city-2-loc-4 city-2-loc-5)
  (= (road-length city-2-loc-4 city-2-loc-5) 31)
  ; 2125,380 -> 2260,86
  (road city-2-loc-6 city-2-loc-1)
  (= (road-length city-2-loc-6 city-2-loc-1) 33)
  ; 2260,86 -> 2125,380
  (road city-2-loc-1 city-2-loc-6)
  (= (road-length city-2-loc-1 city-2-loc-6) 33)
  ; 2125,380 -> 2263,189
  (road city-2-loc-6 city-2-loc-3)
  (= (road-length city-2-loc-6 city-2-loc-3) 24)
  ; 2263,189 -> 2125,380
  (road city-2-loc-3 city-2-loc-6)
  (= (road-length city-2-loc-3 city-2-loc-6) 24)
  ; 2125,380 -> 2195,697
  (road city-2-loc-6 city-2-loc-4)
  (= (road-length city-2-loc-6 city-2-loc-4) 33)
  ; 2195,697 -> 2125,380
  (road city-2-loc-4 city-2-loc-6)
  (= (road-length city-2-loc-4 city-2-loc-6) 33)
  ; 2125,380 -> 2069,978
  (road city-2-loc-6 city-2-loc-5)
  (= (road-length city-2-loc-6 city-2-loc-5) 61)
  ; 2069,978 -> 2125,380
  (road city-2-loc-5 city-2-loc-6)
  (= (road-length city-2-loc-5 city-2-loc-6) 61)
  ; 773,702 <-> 2069,978
  (road city-1-loc-2 city-2-loc-5)
  (= (road-length city-1-loc-2 city-2-loc-5) 133)
  (road city-2-loc-5 city-1-loc-2)
  (= (road-length city-2-loc-5 city-1-loc-2) 133)
  (at package-1 city-1-loc-4)
  (at package-2 city-1-loc-4)
  (at package-3 city-1-loc-6)
  (at package-4 city-1-loc-5)
  (at package-5 city-1-loc-2)
  (at truck-1 city-2-loc-3)
  (capacity truck-1 capacity-2)
  (at truck-2 city-2-loc-3)
  (capacity truck-2 capacity-2)
 )
 (:goal (and
  (at package-1 city-2-loc-5)
  (at package-2 city-2-loc-6)
  (at package-3 city-2-loc-6)
  (at package-4 city-2-loc-6)
  (at package-5 city-2-loc-6)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-1 city-2-loc-3 city-2-loc-4)
   deleted: (at truck-1 city-2-loc-3)
   added: (at truck-1 city-2-loc-4)
   goals met: 0 of 5
2. (drive truck-1 city-2-loc-4 city-2-loc-5)
   deleted: (at truck-1 city-2-loc-4)
   added: (at truck-1 city-2-loc-5)
   goals met: 0 of 5
3. (drive truck-1 city-2-loc-5 city-1-loc-2)
   deleted: (at truck-1 city-2-loc-5)
   added: (at truck-1 city-1-loc-2)
   goals met: 0 of 5
4. (drive truck-1 city-1-loc-2 city-1-loc-4)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-1-loc-4)
   goals met: 0 of 5
5. (pick-up truck-1 city-1-loc-4 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-1-loc-4) (capacity truck-1 capacity-2)
   added: (in package-2 truck-1) (capacity truck-1 capacity-1)
   goals met: 0 of 5
6. (pick-up truck-1 city-1-loc-4 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-1-loc-4) (capacity truck-1 capacity-1)
   added: (in package-1 truck-1) (capacity truck-1 capacity-0)
   goals met: 0 of 5
7. (drive truck-1 city-1-loc-4 city-1-loc-2)
   deleted: (at truck-1 city-1-loc-4)
   added: (at truck-1 city-1-loc-2)
   goals met: 0 of 5
8. (drive truck-1 city-1-loc-2 city-2-loc-5)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-2-loc-5)
   goals met: 0 of 5
9. (drop truck-1 city-2-loc-5 package-1 capacity-0 capacity-1)
   deleted: (in package-1 truck-1) (capacity truck-1 capacity-0)
   added: (at package-1 city-2-loc-5) (capacity truck-1 capacity-1)
   goals met: 1 of 5
10. (drive truck-1 city-2-loc-5 city-1-loc-2)
   deleted: (at truck-1 city-2-loc-5)
   added: (at truck-1 city-1-loc-2)
   goals met: 1 of 5
11. (pick-up truck-1 city-1-loc-2 package-5 capacity-0 capacity-1)
   deleted: (at package-5 city-1-loc-2) (capacity truck-1 capacity-1)
   added: (in package-5 truck-1) (capacity truck-1 capacity-0)
   goals met: 1 of 5
12. (drive truck-1 city-1-loc-2 city-2-loc-5)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-2-loc-5)
   goals met: 1 of 5
13. (drive truck-1 city-2-loc-5 city-2-loc-6)
   deleted: (at truck-1 city-2-loc-5)
   added: (at truck-1 city-2-loc-6)
   goals met: 1 of 5
14. (drop truck-1 city-2-loc-6 package-5 capacity-0 capacity-1)
   deleted: (in package-5 truck-1) (capacity truck-1 capacity-0)
   added: (at package-5 city-2-loc-6) (capacity truck-1 capacity-1)
   goals met: 2 of 5
15. (drop truck-1 city-2-loc-6 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-1)
   added: (at package-2 city-2-loc-6) (capacity truck-1 capacity-2)
   goals met: 3 of 5
16. (drive truck-1 city-2-loc-6 city-2-loc-5)
   deleted: (at truck-1 city-2-loc-6)
   added: (at truck-1 city-2-loc-5)
   goals met: 3 of 5
17. (drive truck-1 city-2-loc-5 city-1-loc-2)
   deleted: (at truck-1 city-2-loc-5)
   added: (at truck-1 city-1-loc-2)
   goals met: 3 of 5
18. (drive truck-1 city-1-loc-2 city-1-loc-1)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-1-loc-1)
   goals met: 3 of 5
19. (drive truck-1 city-1-loc-1 city-1-loc-5)
   deleted: (at truck-1 city-1-loc-1)
   added: (at truck-1 city-1-loc-5)
   goals met: 3 of 5
20. (pick-up truck-1 city-1-loc-5 package-4 capacity-1 capacity-2)
   deleted: (at package-4 city-1-loc-5) (capacity truck-1 capacity-2)
   added: (in package-4 truck-1) (capacity truck-1 capacity-1)
   goals met: 3 of 5
21. (drive truck-1 city-1-loc-5 city-1-loc-1)
   deleted: (at truck-1 city-1-loc-5)
   added: (at truck-1 city-1-loc-1)
   goals met: 3 of 5
22. (drive truck-1 city-1-loc-1 city-1-loc-6)
   deleted: (at truck-1 city-1-loc-1)
   added: (at truck-1 city-1-loc-6)
   goals met: 3 of 5
23. (pick-up truck-1 city-1-loc-6 package-3 capacity-0 capacity-1)
   deleted: (at package-3 city-1-loc-6) (capacity truck-1 capacity-1)
   added: (in package-3 truck-1) (capacity truck-1 capacity-0)
   goals met: 3 of 5
24. (drive truck-1 city-1-loc-6 city-1-loc-2)
   deleted: (at truck-1 city-1-loc-6)
   added: (at truck-1 city-1-loc-2)
   goals met: 3 of 5
25. (drive truck-1 city-1-loc-2 city-2-loc-5)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-2-loc-5)
   goals met: 3 of 5
26. (drive truck-1 city-2-loc-5 city-2-loc-6)
   deleted: (at truck-1 city-2-loc-5)
   added: (at truck-1 city-2-loc-6)
   goals met: 3 of 5
27. (drop truck-1 city-2-loc-6 package-3 capacity-0 capacity-1)
   deleted: (in package-3 truck-1) (capacity truck-1 capacity-0)
   added: (at package-3 city-2-loc-6) (capacity truck-1 capacity-1)
   goals met: 4 of 5
28. (drop truck-1 city-2-loc-6 package-4 capacity-1 capacity-2)
   deleted: (in package-4 truck-1) (capacity truck-1 capacity-1)
   added: (at package-4 city-2-loc-6) (capacity truck-1 capacity-2)
   goals met: 5 of 5
